shivam-salkar/ble-mesh-attendance/firmware/esp32-gateway/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Serial flasher config
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Console Output via ESP32-S3 Native USB (USB Serial/JTAG)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

